Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/atdf/PIC32CK2051GC00064.atdf
        <register name="PRESC" offset="0x14" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Prescaler Value">
          <bitfield name="PRESC" caption="Prescaler Value" mask="0xF" values="PDEC_PRESC__PRESC"/>
        </register>
        <register name="FILTER" offset="0x15" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Filter Value">
          <bitfield name="FILTER" caption="Filter Value" mask="0xFF"/>
        </register>
        <register name="PRESCBUF" offset="0x18" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Prescaler Buffer Value">
          <bitfield name="PRESCBUF" caption="Prescaler Buffer Value" mask="0xF" values="PDEC_PRESCBUF__PRESCBUF"/>
        </register>
        <register name="FILTERBUF" offset="0x19" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Filter Buffer Value">
          <bitfield name="FILTERBUF" caption="Filter Buffer Value" mask="0xFF"/>
        </register>
        <register name="COUNT" offset="0x1C" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="Counter Value">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF"/>
        </register>
        <register name="CC" offset="0x20" rw="RW" access="RWSYNC" size="4" count="2" initval="0x00000000" caption="Channel n Compare Value">
          <bitfield name="CC" caption="Channel Compare Value" mask="0xFFFF"/>
        </register>
        <register name="CCBUF" offset="0x30" rw="RW" access="WSYNC" size="4" count="2" initval="0x00000000" caption="Channel n Compare Buffer Value">
          <bitfield name="CCBUF" caption="Channel Compare Buffer Value" mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="PDEC_CTRLA__MODE">
        <value name="QDEC" caption="QDEC operating mode" value="0"/>
        <value name="HALL" caption="HALL operating mode" value="1"/>
        <value name="COUNTER" caption="COUNTER operating mode" value="2"/>
      </value-group>
      <value-group name="PDEC_CTRLA__CONF">
        <value name="X4" caption="Quadrature decoder direction" value="0"/>
        <value name="X4S" caption="Secure Quadrature decoder direction" value="1"/>
        <value name="X2" caption="Decoder direction" value="2"/>
        <value name="X2S" caption="Secure decoder direction" value="3"/>
        <value name="AUTOC" caption="Auto correction mode" value="4"/>
      </value-group>
      <value-group name="PDEC_CTRLBCLR__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Force a counter restart or retrigger" value="1"/>
        <value name="UPDATE" caption="Force update of double buffered registers" value="2"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="3"/>
        <value name="START" caption="Start QDEC/HALL" value="4"/>
        <value name="STOP" caption="Stop QDEC/HALL" value="5"/>
      </value-group>
      <value-group name="PDEC_CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Force a counter restart or retrigger" value="1"/>
        <value name="UPDATE" caption="Force update of double buffered registers" value="2"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="3"/>
        <value name="START" caption="Start QDEC/HALL" value="4"/>
        <value name="STOP" caption="Stop QDEC/HALL" value="5"/>
      </value-group>
      <value-group name="PDEC_EVCTRL__EVACT">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or retrigger on event" value="1"/>
        <value name="COUNT" caption="Count on event" value="2"/>
      </value-group>
      <value-group name="PDEC_PRESC__PRESC">
        <value name="DIV1" caption="No division" value="0"/>
        <value name="DIV2" caption="Divide by 2" value="1"/>
        <value name="DIV4" caption="Divide by 4" value="2"/>
        <value name="DIV8" caption="Divide by 8" value="3"/>
        <value name="DIV16" caption="Divide by 16" value="4"/>
        <value name="DIV32" caption="Divide by 32" value="5"/>
        <value name="DIV64" caption="Divide by 64" value="6"/>
        <value name="DIV128" caption="Divide by 128" value="7"/>
        <value name="DIV256" caption="Divide by 256" value="8"/>
        <value name="DIV512" caption="Divide by 512" value="9"/>
        <value name="DIV1024" caption="Divide by 1024" value="10"/>
      </value-group>
      <value-group name="PDEC_PRESCBUF__PRESCBUF">
        <value name="DIV1" caption="No division" value="0"/>
        <value name="DIV2" caption="Divide by 2" value="1"/>
        <value name="DIV4" caption="Divide by 4" value="2"/>
        <value name="DIV8" caption="Divide by 8" value="3"/>
        <value name="DIV16" caption="Divide by 16" value="4"/>
        <value name="DIV32" caption="Divide by 32" value="5"/>
        <value name="DIV64" caption="Divide by 64" value="6"/>
        <value name="DIV128" caption="Divide by 128" value="7"/>
        <value name="DIV256" caption="Divide by 256" value="8"/>
        <value name="DIV512" caption="Divide by 512" value="9"/>
        <value name="DIV1024" caption="Divide by 1024" value="10"/>
      </value-group>
    </module>
    <module name="PM" id="03926" name2="pwr_rpmu_pm_v1" version="1b0" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="IORET" caption="I/O Retention" mask="0x4" values="CTRLA__IORET"/>
        </register>
        <register name="SLEEPCFG" offset="0x1" rw="RW" size="1" initval="0x02" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="SLEEPRDY" caption="Backup Sleep Mode Entry Ready Enable" mask="0x1"/>
        </register>
