Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/atdf/PIC32CK2051GC00064.atdf
        <register name="MC2R" offset="0x205" rw="W" size="1" access-size="1" initval="0x00" caption="e.MMC Control 2">
          <bitfield name="SRESP" caption="e.MMC Abort Wait IRQ" mask="0x1"/>
          <bitfield name="ABOOT" caption="e.MMC Abort Boot" mask="0x2"/>
        </register>
        <register name="DEBR" offset="0x207" rw="RW" size="1" access-size="1" initval="0x03" caption="Debounce Register">
          <bitfield name="CDDVAL" caption="Card Detect Debounce Value" mask="0x3" values="DEBR__CDDVAL"/>
        </register>
        <register name="ACR" offset="0x208" rw="RW" size="4" access-size="4" initval="0x00000000" caption="AHB Control">
          <bitfield name="BMAX" caption="AHB Maximum Burst" mask="0x3" values="ACR__BMAX"/>
        </register>
        <register name="CC2R" offset="0x20C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Clock Control 2">
          <bitfield name="FSDCLKD" caption="Force SDCK Disabled" mask="0x1" values="CC2R__FSDCLKD"/>
        </register>
        <register name="CACR" offset="0x230" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Capabilities Control">
          <bitfield name="CAPWREN" caption="Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers)" mask="0x1"/>
          <bitfield name="KEY" caption="Key (0x46)" mask="0xFF00"/>
        </register>
        <register name="DBGR" offset="0x234" rw="RW" size="4" access-size="4" initval="0x00000002" caption="Debug">
          <bitfield name="NIDBG" caption="Non-intrusive debug enable" mask="0x1" values="DBGR__NIDBG"/>
        </register>
      </register-group>
      <value-group name="BSR__BOUNDARY">
        <value name="4K" caption="4k bytes" value="0"/>
        <value name="8K" caption="8k bytes" value="1"/>
        <value name="16K" caption="16k bytes" value="2"/>
        <value name="32K" caption="32k bytes" value="3"/>
        <value name="64K" caption="64k bytes" value="4"/>
        <value name="128K" caption="128k bytes" value="5"/>
        <value name="256K" caption="256k bytes" value="6"/>
        <value name="512K" caption="512k bytes" value="7"/>
      </value-group>
      <value-group name="TMR__DMAEN">
        <value name="DISABLE" caption="No data transfer or Non DMA data transfer" value="0"/>
        <value name="ENABLE" caption="DMA data transfer" value="1"/>
      </value-group>
      <value-group name="TMR__BCEN">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="TMR__ACMDEN">
        <value name="DISABLED" caption="Auto Command Disabled" value="0"/>
        <value name="CMD12" caption="Auto CMD12 Enable" value="1"/>
        <value name="CMD23" caption="Auto CMD23 Enable" value="2"/>
      </value-group>
      <value-group name="TMR__DTDSEL">
        <value name="WRITE" caption="Write (Host to Card)" value="0"/>
        <value name="READ" caption="Read (Card to Host)" value="1"/>
      </value-group>
      <value-group name="TMR__MSBSEL">
        <value name="SINGLE" caption="Single Block" value="0"/>
        <value name="MULTIPLE" caption="Multiple Block" value="1"/>
      </value-group>
      <value-group name="CR__RESPTYP">
        <value name="NONE" caption="No response" value="0"/>
        <value name="136_BIT" caption="136-bit response" value="1"/>
        <value name="48_BIT" caption="48-bit response" value="2"/>
        <value name="48_BIT_BUSY" caption="48-bit response check busy after response" value="3"/>
      </value-group>
      <value-group name="CR__CMDCCEN">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="CR__CMDICEN">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="CR__DPSEL">
        <value name="NO_DATA" caption="No Data Present" value="0"/>
        <value name="DATA" caption="Data Present" value="1"/>
      </value-group>
      <value-group name="CR__CMDTYP">
        <value name="NORMAL" caption="Other commands" value="0"/>
        <value name="SUSPEND" caption="CMD52 for writing Bus Suspend in CCCR" value="1"/>
        <value name="RESUME" caption="CMD52 for writing Function Select in CCCR" value="2"/>
        <value name="ABORT" caption="CMD12, CMD52 for writing I/O Abort in CCCR" value="3"/>
      </value-group>
      <value-group name="PSR__CMDINHC">
        <value name="CAN" caption="Can issue command using only CMD line" value="0"/>
        <value name="CANNOT" caption="Cannot issue command" value="1"/>
      </value-group>
      <value-group name="PSR__CMDINHD">
        <value name="CAN" caption="Can issue command which uses the DAT line" value="0"/>
        <value name="CANNOT" caption="Cannot issue command which uses the DAT line" value="1"/>
      </value-group>
      <value-group name="PSR__DLACT">
        <value name="INACTIVE" caption="DAT Line Inactive" value="0"/>
        <value name="ACTIVE" caption="DAT Line Active" value="1"/>
      </value-group>
      <value-group name="PSR__RTREQ">
        <value name="OK" caption="Fixed or well-tuned sampling clock" value="0"/>
        <value name="REQUIRED" caption="Sampling clock needs re-tuning" value="1"/>
      </value-group>
      <value-group name="PSR__WTACT">
        <value name="NO" caption="No valid data" value="0"/>
        <value name="YES" caption="Transferring data" value="1"/>
      </value-group>
      <value-group name="PSR__RTACT">
        <value name="NO" caption="No valid data" value="0"/>
        <value name="YES" caption="Transferring data" value="1"/>
      </value-group>
      <value-group name="PSR__BUFWREN">
        <value name="DISABLE" caption="Write disable" value="0"/>
        <value name="ENABLE" caption="Write enable" value="1"/>
      </value-group>
      <value-group name="PSR__BUFRDEN">
        <value name="DISABLE" caption="Read disable" value="0"/>
        <value name="ENABLE" caption="Read enable" value="1"/>
      </value-group>
      <value-group name="PSR__CARDINS">
        <value name="NO" caption="Reset or Debouncing or No Card" value="0"/>
        <value name="YES" caption="Card inserted" value="1"/>
      </value-group>
      <value-group name="PSR__CARDSS">
        <value name="NO" caption="Reset or Debouncing" value="0"/>
        <value name="YES" caption="No Card or Insered" value="1"/>
      </value-group>
      <value-group name="PSR__CARDDPL">
        <value name="NO" caption="No card present (SDCD#=1)" value="0"/>
        <value name="YES" caption="Card present (SDCD#=0)" value="1"/>
      </value-group>
      <value-group name="PSR__WRPPL">
        <value name="PROTECTED" caption="Write protected (SDWP#=0)" value="0"/>
        <value name="ENABLED" caption="Write enabled (SDWP#=1)" value="1"/>
      </value-group>
      <value-group name="HC1R__LEDCTRL">
        <value name="OFF" caption="LED off" value="0"/>
        <value name="ON" caption="LED on" value="1"/>
      </value-group>
      <value-group name="HC1R__DW">
        <value name="1BIT" caption="1-bit mode" value="0"/>
        <value name="4BIT" caption="4-bit mode" value="1"/>
      </value-group>
      <value-group name="HC1R__HSEN">
        <value name="NORMAL" caption="Normal Speed mode" value="0"/>
        <value name="HIGH" caption="High Speed mode" value="1"/>
      </value-group>
      <value-group name="HC1R__DMASEL">
        <value name="SDMA" caption="SDMA is selected" value="0"/>
        <value name="32BIT" caption="32-bit Address ADMA2 is selected" value="2"/>
      </value-group>
      <value-group name="HC1R__CARDDTL">
        <value name="NO" caption="No Card" value="0"/>
        <value name="YES" caption="Card Inserted" value="1"/>
      </value-group>
      <value-group name="HC1R__CARDDSEL">
        <value name="NORMAL" caption="SDCD# is selected (for normal use)" value="0"/>
        <value name="TEST" caption="The Card Select Test Level is selected (for test purpose)" value="1"/>
      </value-group>
      <value-group name="PCR__SDBPWR">
        <value name="OFF" caption="Power off" value="0"/>
        <value name="ON" caption="Power on" value="1"/>
      </value-group>
      <value-group name="PCR__SDBVSEL">
        <value name="1V8" caption="1.8V (Typ.)" value="5"/>
        <value name="3V0" caption="3.0V (Typ.)" value="6"/>
        <value name="3V3" caption="3.3V (Typ.)" value="7"/>
      </value-group>
      <value-group name="BGCR__STPBGR">
        <value name="TRANSFER" caption="Transfer" value="0"/>
        <value name="STOP" caption="Stop" value="1"/>
      </value-group>
