Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/atdf/PIC32CK2051GC00064.atdf
        <register name="CCBUF" offset="0x70" rw="RW" access="WSYNC" size="4" count="6" initval="0x00000000" caption="Compare and Capture Buffer">
          <mode name="DEFAULT" qualifier="TCC.CTRLA.RESOLUTION" value="0"/>
          <mode name="DITH4" qualifier="TCC.CTRLA.RESOLUTION" value="1"/>
          <mode name="DITH5" qualifier="TCC.CTRLA.RESOLUTION" value="2"/>
          <mode name="DITH6" qualifier="TCC.CTRLA.RESOLUTION" value="3"/>
          <bitfield modes="DITH4" name="DITHERBUF" caption="Channel Compare/Capture Buffer Value" mask="0xF"/>
          <bitfield modes="DITH5" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0x1F"/>
          <bitfield modes="DITH6" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0x3F"/>
          <bitfield modes="DITH6" name="CCBUF" caption="Channel Compare/Capture Buffer Value" mask="0xFFFFFFC0"/>
          <bitfield modes="DITH5" name="CCBUF" caption="Channel Compare/Capture Buffer Value" mask="0xFFFFFFE0"/>
          <bitfield modes="DITH4" name="CCBUF" caption="Dithering Buffer Cycle Number" mask="0xFFFFFFF0"/>
          <bitfield modes="DEFAULT" name="CCBUF" caption="Channel Compare/Capture Buffer Value" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="CTRLA__RESOLUTION">
        <value name="NONE" caption="Dithering is disabled" value="0"/>
        <value name="DITH4" caption="Dithering is done every 16 PWM frames" value="1"/>
        <value name="DITH5" caption="Dithering is done every 32 PWM frames" value="2"/>
        <value name="DITH6" caption="Dithering is done every 64 PWM frames" value="3"/>
      </value-group>
      <value-group name="TCC_CTRLA__PRESCALER">
        <value name="DIV1" caption="No division" value="0"/>
        <value name="DIV2" caption="Divide by 2" value="1"/>
        <value name="DIV4" caption="Divide by 4" value="2"/>
        <value name="DIV8" caption="Divide by 8" value="3"/>
        <value name="DIV16" caption="Divide by 16" value="4"/>
        <value name="DIV64" caption="Divide by 64" value="5"/>
        <value name="DIV256" caption="Divide by 256" value="6"/>
        <value name="DIV1024" caption="Divide by 1024" value="7"/>
      </value-group>
      <value-group name="CTRLA__PRESCSYNC">
        <value name="GCLK" caption="Reload or reset counter on next GCLK" value="0"/>
        <value name="PRESC" caption="Reload or reset counter on next prescaler clock" value="1"/>
        <value name="RESYNC" caption="Reload or reset counter on next GCLK and reset prescaler counter" value="2"/>
      </value-group>
      <value-group name="CTRLBCLR__IDXCMD">
        <value name="DISABLE" caption="Command disabled: Index toggles between cycles A and B" value="0"/>
        <value name="SET" caption="Set index: cycle B will be forced in the next cycle" value="1"/>
        <value name="CLEAR" caption="Clear index: cycle A will be forced in the next cycle" value="2"/>
        <value name="HOLD" caption="Hold index: the next cycle will be the same as the current cycle" value="3"/>
      </value-group>
      <value-group name="CTRLBCLR__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Clear start, restart or retrigger" value="1"/>
        <value name="STOP" caption="Force stop" value="2"/>
        <value name="UPDATE" caption="Force update or double buffered registers" value="3"/>
        <value name="READSYNC" caption="Force COUNT read synchronization" value="4"/>
        <value name="DMAOS" caption="One-shot DMA trigger" value="5"/>
      </value-group>
      <value-group name="CTRLBSET__IDXCMD">
        <value name="DISABLE" caption="Command disabled: Index toggles between cycles A and B" value="0"/>
        <value name="SET" caption="Set index: cycle B will be forced in the next cycle" value="1"/>
        <value name="CLEAR" caption="Clear index: cycle A will be forced in the next cycle" value="2"/>
        <value name="HOLD" caption="Hold index: the next cycle will be the same as the current cycle" value="3"/>
      </value-group>
      <value-group name="CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Clear start, restart or retrigger" value="1"/>
        <value name="STOP" caption="Force stop" value="2"/>
        <value name="UPDATE" caption="Force update or double buffered registers" value="3"/>
        <value name="READSYNC" caption="Force COUNT read synchronization" value="4"/>
        <value name="DMAOS" caption="One-shot DMA trigger" value="5"/>
      </value-group>
      <value-group name="FCTRLA__SRC">
        <value name="DISABLE" caption="Fault input disabled" value="0"/>
        <value name="ENABLE" caption="MCEx (x=0,1) event input" value="1"/>
        <value name="INVERT" caption="Inverted MCEx (x=0,1) event input" value="2"/>
        <value name="ALTFAULT" caption="Alternate fault (A or B) state at the end of the previous period" value="3"/>
      </value-group>
      <value-group name="FCTRLA__BLANK">
        <value name="START" caption="Blanking applied from start of the ramp" value="0"/>
        <value name="RISE" caption="Blanking applied from rising edge of the output waveform" value="1"/>
        <value name="FALL" caption="Blanking applied from falling edge of the output waveform" value="2"/>
        <value name="BOTH" caption="Blanking applied from each toggle of the output waveform" value="3"/>
      </value-group>
      <value-group name="FCTRLA__HALT">
        <value name="DISABLE" caption="Halt action disabled" value="0"/>
        <value name="HW" caption="Hardware halt action" value="1"/>
        <value name="SW" caption="Software halt action" value="2"/>
        <value name="NR" caption="Non-recoverable fault" value="3"/>
      </value-group>
      <value-group name="FCTRLA__CHSEL">
        <value name="CC0" caption="Capture value stored in channel 0" value="0"/>
        <value name="CC1" caption="Capture value stored in channel 1" value="1"/>
        <value name="CC2" caption="Capture value stored in channel 2" value="2"/>
        <value name="CC3" caption="Capture value stored in channel 3" value="3"/>
      </value-group>
