Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/atdf/PIC32CK2051GC00064.atdf
      <value-group name="FFCR__EnFmt">
        <value name="BYPASS" caption="Disable formatting" value="0"/>
        <value name="CONT" caption="Continuous formatting and embed triggers and null cycles" value="2"/>
      </value-group>
      <value-group name="LAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
    </module>
    <module name="TRAM" id="03938" name2="drm_tram_u2801_v2" version="2a0" caption="TrustRAM">
      <register-group name="TRAM" caption="TrustRAM">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="TAMPERS" caption="Tamper Erase" mask="0x10"/>
          <bitfield name="DRP" caption="Data Remanence Prevention" mask="0x40"/>
          <bitfield name="SILACC" caption="Silent Access" mask="0x80"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="ERR" caption="TrustRAM Readout Error Interrupt Enable" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x8" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="ERR" caption="TrustRAM Readout Error Interrupt Enable" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="ERR" caption="TrustRAM Readout Error" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="RAMINV" caption="RAM Inversion Bit" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ongoing" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Busy" mask="0x2"/>
        </register>
        <register name="DSCC" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Data Scramble Control">
          <bitfield name="DSCKEY" caption="Data Scramble Key" mask="0x3FFFFFFF"/>
          <bitfield name="DSCEN" caption="Data Scramble Enable" mask="0x80000000"/>
        </register>
        <register name="PERMW" offset="0x1C" rw="W" size="4" initval="0x00000000" caption="Permutation Write">
          <bitfield name="DATA" caption="Permutation Scrambler Data Input" mask="0x7"/>
        </register>
        <register name="PERMR" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Permutation Read">
          <bitfield name="DATA" caption="Permutation Scrambler Data Output" mask="0x7"/>
        </register>
        <register name="RAM" offset="0x1000" rw="RW" size="4" count="2048" initval="0x00000000" caption="TrustRAM">
          <bitfield name="DATA" caption="Trust RAM Data" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="TRNG" id="03597" name2="math_trng_u2242_v1" version="1d0" caption="True Random Generator">
      <register-group name="TRNG" caption="True Random Generator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="DATARDYEO" caption="Data Ready Event Output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="DATARDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="DATARDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="DATARDY" caption="Data Ready Interrupt Flag" mask="0x1"/>
        </register>
        <register name="DATA" offset="0x20" rw="R" size="4" caption="Output Data">
          <bitfield name="DATA" caption="Output Data" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="USB" id="03613" name2="usb_u2222_v1" version="1d0" caption="Full-Speed Universal Serial Bus">
      <register-group name="DEVICE_DESC_BANK" size="0x10">
        <mode name="DEVICE" qualifier="USB.CTRLA.MODE" value="0" caption="USB is Device"/>
        <register modes="DEVICE" name="ADDR" offset="0x0" rw="RW" size="4" caption="DEVICE_DESC_BANK Endpoint Bank, Adress of Data Buffer">
          <bitfield name="ADDR" caption="Adress of data buffer" mask="0xFFFFFFFF"/>
        </register>
        <register modes="DEVICE" name="PCKSIZE" offset="0x4" rw="RW" size="4" caption="DEVICE_DESC_BANK Endpoint Bank, Packet Size">
          <bitfield name="BYTE_COUNT" caption="Byte Count" mask="0x3FFF"/>
          <bitfield name="MULTI_PACKET_SIZE" caption="Multi Packet In or Out size" mask="0xFFFC000"/>
          <bitfield name="SIZE" caption="Enpoint size" mask="0x70000000"/>
          <bitfield name="AUTO_ZLP" caption="Automatic Zero Length Packet" mask="0x80000000"/>
        </register>
        <register modes="DEVICE" name="EXTREG" offset="0x8" rw="RW" size="2" caption="DEVICE_DESC_BANK Endpoint Bank, Extended">
          <bitfield name="SUBPID" caption="SUBPID field send with extended token" mask="0xF"/>
          <bitfield name="VARIABLE" caption="Variable field send with extended token" mask="0x7FF0"/>
        </register>
