Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/atdf/PIC32CK2051GC00064.atdf
        <register modes="ENDPOINT0" name="TYPE0" offset="0x101A" rw="RW" size="1" initval="0x00" caption="ENDPOINT0 Host Mode Only: Operating Speed Of The Targeted Device">
          <bitfield name="SPEED" caption="Operating Speed Of The Target Device" mask="0xC0" values="ENDPOINT0_TYPE0__SPEED"/>
        </register>
        <register modes="ENDPOINTX" name="TXINTERVAL" offset="0x101B" rw="RW" size="1" initval="0x00" caption="ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected TX Endpoint.">
          <bitfield name="TXPOLLINGINTERVAL" caption="polling interval" mask="0xFF"/>
        </register>
        <register modes="ENDPOINT0" name="NAKLIMIT0" offset="0x101B" rw="RW" size="1" initval="0x00" caption="ENDPOINT0 Host Mode Only: Sets The NAK Response Timeout On Endpoint 0.">
          <bitfield name="EP0NAKLIMIT" caption="Number Of Frames/Microframes After Which Endpoint 0 Should Timeout" mask="0x1F"/>
        </register>
        <register modes="ENDPOINTX" name="RXTYPE" offset="0x101C" rw="RW" size="1" initval="0x00" caption="ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint">
          <bitfield name="ENDPOINTNUMBER" caption="the cpu should set this value to the endpoint number contained in the rx endpoint descriptor returned to the musbmhdrc during device enumeration." mask="0xF"/>
          <bitfield name="PROTOCOL" caption="the cpu should set this to select the required protocol for the rx endpoint 00: control 01: isochronous 10: bulk 11: interrupt" mask="0x30" values="ENDPOINTX_RXTYPE__PROTOCOL"/>
          <bitfield name="SPEED" caption="operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low" mask="0xC0" values="ENDPOINTX_RXTYPE__SPEED"/>
        </register>
        <register modes="ENDPOINTX" name="RXINTERVAL" offset="0x101D" rw="RW" size="1" initval="0x00" caption="ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected RX Endpoint.">
          <bitfield name="RXPOLLINGINTERVAL" caption="polling interval" mask="0xFF"/>
        </register>
        <register modes="ENDPOINTX" name="FIFOSIZE" offset="0x101F" rw="R" size="1" initval="0x00" caption="ENDPOINTX Read Only Register That Returns The Sizes Of The FIFO's Associated With The Selected Additional TX/RX Endpoints. INDEX Regsiter should be set 1-15">
          <bitfield name="TXFIFOSIZE" caption="Tx FIFO Size" mask="0xF"/>
          <bitfield name="RXFIFOSIZE" caption="Rx FIFO Size" mask="0xF0"/>
        </register>
        <register modes="ENDPOINT0" name="CONFIGDATA" offset="0x101F" rw="R" size="1" initval="0x00" caption="ENDPOINT0 Returns Information About The Selected Core Configuration. Only Applicable when INDEX Regsiter Is 0. That Is Endpoint0 Is Selected.">
          <bitfield name="UTMIDATAWIDTH" caption="Indicates Selected UTMI+ DataWidth. Always 0 Indicates 8 Bits" mask="0x1"/>
          <bitfield name="SOFTCONE" caption="Indicates Soft Connect Or Disconnect" mask="0x2"/>
          <bitfield name="DYNFIFOSIZING" caption="Dynamic FIFO Sizing Is Selected Or Not" mask="0x4"/>
          <bitfield name="HBTXE" caption="Indicates High Bandwidth TX ISO Endpoint Support Selected" mask="0x8"/>
          <bitfield name="HBRXE" caption="Indicates High Bandwidth RX ISO Endpoint Support Selected" mask="0x10"/>
          <bitfield name="BIGENDIAN" caption="Indicates Little Endian Ordering" mask="0x20"/>
          <bitfield name="MPTXE" caption="Automatic Splitting Of Bulk Packets Is Selected" mask="0x40"/>
          <bitfield name="MPRXE" caption="Automatic Splitting Of Bulk Amalgamation Is Selected" mask="0x80"/>
        </register>
        <register name="FIFOX" offset="0x1020" rw="RW" size="4" count="8" initval="0x00000000" caption="Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint">
          <bitfield name="FIFOADDR" caption="Writing To These Addresses Loads Data Into The TXFIFO For The Corresponding Endpoint" mask="0xFFFFFFFF"/>
        </register>
        <register name="DEVCTL" offset="0x1060" rw="RW" size="1" initval="0x80" caption="Selects Whether The Core Is Operating In Peripheral Or Host Mode">
          <bitfield name="SESSION" caption="when operating as an 'A' device, this bit is set or cleared by CPU to state or end a session. when operating as a 'B' device, this bit is set/cleared by the USBCORE when a session starts/ends" mask="0x1"/>
          <bitfield name="HOSTREQ" caption="when set, the USBCORE will initiate the host negotiation when suspend mode is entered." mask="0x2"/>
          <bitfield name="HOSTMODE" caption="this read-only bit is set when the USBCORE is acting as a host" mask="0x4"/>
          <bitfield name="VBUS" caption="encoded value for the VBus level" mask="0x18" values="DEVCTL__VBUS"/>
          <bitfield name="LSDEV" caption="host mode only: this bit is set when a low speed device has been detected being connected to the port" mask="0x20"/>
          <bitfield name="FSDEV" caption="host mode only: this bit is set when a full or high speed device has been detected being connected to the port" mask="0x40"/>
          <bitfield name="BDEVICE" caption="indicates whether the core is operating as a 'A' device or 'B' device" mask="0x80"/>
        </register>
        <register name="MISC" offset="0x1061" rw="RW" size="1" initval="0x00" caption="RX/TX Early DMA Enable Bits">
          <bitfield name="RXEDMA" caption="DMA_REQ signal for all OUT endpoints will be deasserted based on this bit selection" mask="0x1" values="MISC__RXEDMA"/>
          <bitfield name="TXEDMA" caption="DMA_REQ signal for all IN endpoints will be deasserted based on this bit selection" mask="0x2" values="MISC__TXEDMA"/>
        </register>
        <register name="TXFIFOSZ" offset="0x1062" rw="RW" size="1" initval="0x00" caption="Controls The Size Of The Selected TX Endpoint FIFO">
          <bitfield name="SZ" caption="maximum packet size to be allowed" mask="0xF" values="TXFIFOSZ__SZ"/>
          <bitfield name="DPB" caption="double packet buffering supported or not" mask="0x10"/>
        </register>
        <register name="RXFIFOSZ" offset="0x1063" rw="RW" size="1" initval="0x00" caption="Controls The Size Of The Selected RX Endpoint FIFO">
          <bitfield name="SZ" caption="maximum packet size to be allowed" mask="0xF" values="RXFIFOSZ__SZ"/>
          <bitfield name="DPB" caption="double packet buffering enabled or not" mask="0x10"/>
        </register>
        <register name="TXFIFOADD" offset="0x1064" rw="RW" size="2" initval="0x0000" caption="Controls The Start Address Of the Selected TX Endpoint FIFO">
          <bitfield name="ADDR" caption="start address of the endpoint FIFO" mask="0x1FFF"/>
        </register>
        <register name="RXFIFOADD" offset="0x1066" rw="RW" size="2" initval="0x0000" caption="Controls The Start Address Of the Selected RX Endpoint FIFO">
          <bitfield name="ADDR" caption="start address of the endpoint FIFO" mask="0x1FFF"/>
        </register>
